Билет03/Documents/РасходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>РасходнаяНакладная</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиТоваров</xr:Item>
				<xr:Item>AccountingRegister.ЖурналПроводок</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВВалютеВзаиморасчетов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОУ</Name>
					<Comment>!! не нужно это делать! (если никак- писать в объяснении</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БУ</Name>
					<Comment>!! не нужно это делать! (если никак- писать в объяснении</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УФ</Name>
					<Comment>!! не нужно это делать! (если никак- писать в объяснении</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТоварыИУслуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Билет03/AccumulationRegisters/ОстаткиТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УстановитьУчетнуюПолитику</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Билет03/AccountingRegisters/ЖурналПроводок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccountingRegister>
		<Properties>
			<Name>ЖурналПроводок</Name>
			<ChartOfAccounts>ChartOfAccounts.ПланСчетовБУ</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВВал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ПланСчетовБУ.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Resource>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Билет03/InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Билет03/Documents/РасходнаяНакладная/Ext/ObjectModule.bsl
Процедура ОбработкаПроведенияОУ(Отказ, Режим)
	// регистр ОстаткиТоваров Расход
	Движения.ОстаткиТоваров.Очистить();
	Движения.ОстаткиТоваров.БлокироватьДляИзменения = Истина;
	Движения.ОстаткиТоваров.Записывать = Истина;
	
	//----------- Блокировка ------------------
	Блокировка		= Новый БлокировкаДанных;
	ЭлБлокировки	= Блокировка.Добавить("РегистрНакопления.ОстаткиТоваров");	
	ЭлБлокировки.Режим	= РежимБлокировкиДанных.Исключительный;
	ЭлБлокировки.ИсточникДанных	= ТоварыИУслуги;
	ЭлБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
	Блокировка.Заблокировать();
	//-----------------------------------------
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходнаяНакладнаяТоварыИУслуги.Номенклатура КАК Номенклатура,
		|	СУММА(РасходнаяНакладнаяТоварыИУслуги.Количество) КАК Количество,
		|	СУММА(РасходнаяНакладнаяТоварыИУслуги.Сумма) КАК Сумма,
		|	РасходнаяНакладнаяТоварыИУслуги.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ вт_ДокТЧ
		|ИЗ
		|	Документ.РасходнаяНакладная.ТоварыИУслуги КАК РасходнаяНакладнаяТоварыИУслуги
		|ГДЕ
		|	РасходнаяНакладнаяТоварыИУслуги.Ссылка = &Ссылка
		|	И НЕ РасходнаяНакладнаяТоварыИУслуги.Номенклатура.Услуга
		|
		|СГРУППИРОВАТЬ ПО
		|	РасходнаяНакладнаяТоварыИУслуги.Номенклатура,
		|	РасходнаяНакладнаяТоварыИУслуги.НомерСтроки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_ДокТЧ.Номенклатура КАК Номенклатура,
		|	вт_ДокТЧ.Количество КАК Количество,
		|	ОстаткиТоваровОстатки.Партия КАК Партия,
		|	ЕСТЬNULL(ОстаткиТоваровОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
		|	ОстаткиТоваровОстатки.СуммаОстаток КАК СуммаОстаток,
		|	вт_ДокТЧ.Номенклатура.Представление КАК НоменклатураПредставление,
		|	вт_ДокТЧ.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	вт_ДокТЧ КАК вт_ДокТЧ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваров.Остатки(
		|				&МоментВремени,
		|				Номенклатура В
		|					(ВЫБРАТЬ
		|						вт_ДокТЧ.Номенклатура
		|					ИЗ
		|						вт_ДокТЧ КАК вт_ДокТЧ)) КАК ОстаткиТоваровОстатки
		|		ПО вт_ДокТЧ.Номенклатура = ОстаткиТоваровОстатки.Номенклатура
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОстаткиТоваровОстатки.Партия.МоментВремени
		|ИТОГИ
		|	МАКСИМУМ(Количество),
		|	СУММА(КоличествоОстаток),
		|	СУММА(СуммаОстаток),
		|	МИНИМУМ(НомерСтроки)
		|ПО
		|	Номенклатура,
		|	НоменклатураПредставление";
// !! УПОРЯДОЧИТЬ ПО  МоментВремени
	
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	// не нужно ещё одну вложенность ВыборкаНоменклатураПредст, т.к. представление итак формируется при группировк по полю Номенклатура
	ВыборкаНоменклатура = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаНоменклатура.Следующий() Цикл
	ВыборкаНоменклатураПредст = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаНоменклатураПредст.Следующий() Цикл
		Если ВыборкаНоменклатураПредст.Количество > ВыборкаНоменклатураПредст.КоличествоОстаток Тогда
			Отказ	= Истина;
			Сообщение		= Новый СообщениеПользователю;
			Сообщение.Текст	= СтрШаблон("Не хватает %1 товара %2", СокрЛП(ВыборкаНоменклатураПредст.Количество - ВыборкаНоменклатураПредст.КоличествоОстаток), ВыборкаНоменклатураПредст.НоменклатураПредставление);
			// Привязка выводимого сообщения к полю формы (требование задачи по управляемым формам)	- двойной клик мышкой на сообщении	
			// !! именно Объект. нужен
			Сообщение.Поле = "Объект.ТоварыИУслуги["+СокрЛП(ВыборкаНоменклатураПредст.НомерСтроки - 1)+"].Количество";
			Сообщение.Сообщить();
		КонецЕсли;
		
		Если Отказ Тогда
		    Продолжить;
		КонецЕсли; 
		
		ОсталосьСписать	= ВыборкаНоменклатураПредст.Количество;
		
		Выборка	= ВыборкаНоменклатураПредст.Выбрать();
		Пока Выборка.Следующий() и ОсталосьСписать > 0 Цикл
			Списать		= Мин(Выборка.Количество, Выборка.КоличествоОстаток);
			Если Списать = Выборка.КоличествоОстаток Тогда
				Себестоимость	= Выборка.СуммаОстаток;			
			Иначе		
				Себестоимость	= Выборка.Количество / Выборка.КоличествоОстаток * Выборка.СуммаОстаток;			
			КонецЕсли; 
			
			Движение = Движения.ОстаткиТоваров.ДобавитьРасход();
			Движение.Период = Дата;
			Движение.Номенклатура = Выборка.Номенклатура;
			Движение.Партия = Выборка.Партия;
			Движение.Количество = Списать;
			Движение.Сумма = Себестоимость;
			
			ОсталосьСписать	= ОсталосьСписать - Списать;
		КонецЦикла;
	КонецЦикла;
	КонецЦикла;
	

КонецПроцедуры

Процедура ОбработкаПроведенияБУ(Отказ, Режим)
	// регистр ЖурналПроводок 
	Движения.ЖурналПроводок.Очистить();
	Движения.ЖурналПроводок.Записывать = Истина;
	
	Курс	= РегистрыСведений.КурсыВалют.ПолучитьПоследнее(МоментВремени(), Новый Структура("Валюта", Договор.ВалютаВзаиморасчетов)).Курс;
	Если НЕ ЗначениеЗаполнено(Курс) Тогда
		Курс	= 1;	
	КонецЕсли; 
	
	Движение = Движения.ЖурналПроводок.Добавить();
	Движение.СчетДт = ПланыСчетов.ПланСчетовБУ.Покупатели;
	Движение.СчетКт = ПланыСчетов.ПланСчетовБУ.ПрибыльИУбытки;
	Движение.Период = Дата;
	Движение.Сумма = СуммаВВалютеВзаиморасчетов * Курс;
	Движение.СуммаВВалДт = СуммаВВалютеВзаиморасчетов;
	Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты] = Контрагент;
	Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Договоры] = Договор;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	Если ОУ Тогда ОбработкаПроведенияОУ(Отказ, Режим);
	КонецЕсли; 	
	
	Если БУ Тогда ОбработкаПроведенияБУ(Отказ, Режим);
	КонецЕсли; 	
КонецПроцедуры
